package com.day08;

public class 构造方法 {
    public static void main(String[] args) {
        /*
        public class 类名{
            修饰符 类名 (参数){
                    方法体;
            }
        }
        特点:
        1,构造的方法要和类名保持一致
        2,没有返回值类型,就连void都没有
        3,没有具体的返回值,也就是说不能由return带回返回值

        他的作用就是为了创建对对象时,给对象的成员变量的数值初始化值

        两种构造方式:
        第一种:没有参数,当我们没有写的时候,系统会默认帮我们写出
        初始化对象的时候,成员变量的数据都是默认值
        第二种:有参数(是带全部参数),在初始化的时候我们可以将对对象进行赋值
        (大概就是创建对象的时候使用的吧!)

        这个也有重构哈哈哈哈!

        * */
    }
}
